///////////////////////////////////////////////////////////////////////////////
//
// ООО НТО «ИРЭ-Полюс»
//
// Авторское право:
//   ООО НТО «ИРЭ-Полюс»
//
//	Эта программа не может воспроизведена, целиком или частично в любой форме
//	без письменного разрешения:
//
//  ООО НТО «ИРЭ-Полюс»
//	 Россия, 141190, Московская область, г.Фрязино	пл. Введенского, дом 1, строение 3.
//
// Имя файла: 		string_fnc.c
//
// Дата:			01.2012
//
// Описание:		Модуль функций преобразования числа в ASCII строку и наоборот
//                                                     
//
// Автор:			Сотников Александр Евгеньевич
//
// Процессор:      	STM32F207VE
//
// Компилятор:     	Keil MDK ARM Standard V4.20
//
// Версия:         	2
//
//								
///////////////////////////////////////////////////////////////////////////////
//=============================================================================
// Модуль функций преобразования числа в ASCII строку и наоборот
//=============================================================================
#include "string_fnc.h"
#include <string.h>
#include <stdlib.h>
//=============================================================================
// Функция преобразования беззнакового байта в строку с возвратом указателя на конец строки 
// выполняется максимум 3мксек на STM32F207
// Аргументы функции:
// str - буфер для печати строки
// byVal - Печатаемое значение
// функция возвращает указатель на конец строки
//=============================================================================
char * ByteToStr( char * str, unsigned char byVal )
{
	if( !str ) 
		return str;
	char * pStartStr = str;
  unsigned int dwDig, dwPrint;
	dwPrint = 0;
	unsigned int dwVal = byVal;

	//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
	dwVal *= 2684400;
	for( unsigned int i = 0; i < 3; i++ )
	{
			dwDig = dwVal >> 28;
			if( dwDig || dwPrint )//нули печатаем, если только какое либо ненулевое значение уже напечатано
			{
					*str++ = dwDig + '0';
					dwPrint = 1;
			}
			dwVal &= 0x0FFFFFFF;
			dwVal *= 10;
	}
	if( str == pStartStr )
	{
		*str++ = '0';
		*str = 0;
	}// ничего не напечатали, значит 0
	*str = 0;//конец строки
	return str;
}
//=============================================================================
// Функция преобразования беззнакового целого в строку с возвратом указателя на конец строки 
// выполняется максимум 8мксек на STM32F207
// Аргументы функции:
// str - буфер для печати строки
// dwVal - Печатаемое значение
// функция возвращает указатель на конец строки
//=============================================================================
char * UintToStr( char * str, unsigned int dwVal )
{
	if( !str )
		return str;
	char * pStartStr = str;
  unsigned int dwDig, dwPrint;
	dwPrint = 0;
	//алгоритм разбиваем на 2 этапа 1..99999 и 100000..макс32бит
	if( dwVal > 99999 )
	{
		unsigned int dwVal1 = dwVal / 100000;//готовим старшие десятичные разряды для перобразования
		dwVal -= dwVal1 * 100000;

	//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
		dwVal1 *= 26844;
		for( unsigned int i = 0; i < 5; i++ )
		{
				dwDig = dwVal1 >> 28;
				if( dwDig || dwPrint )//нули печатаем, если только какое либо ненулевое значение уже напечатано
				{
						*str++ = dwDig + '0';
						dwPrint = 1;
				}
				dwVal1 &= 0x0FFFFFFF;
				dwVal1 *= 10;
		}
	}

	//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
	// в алгоритме есть выколотая точка, учитываем её особым образом
	if( dwVal == 59075 ) 
	{
		*str++ = '5';
		*str++ = '9';
		*str++ = '0';
		*str++ = '7';
		*str++ = '5';
		*str = 0;
		return str;
	}
	if( dwVal > 59075 )
		dwVal--;
	//основная часть алгоритма для оставшихся младших десятичных разрядов
	dwVal *= 26844;
	for( unsigned int i = 0; i < 5; i++ )
	{
			dwDig = dwVal >> 28;
			if( dwDig || dwPrint )//нули печатаем, если только какое либо ненулевое значение уже напечатано
			{
					*str++ = dwDig + '0';
					dwPrint = 1;
			}
			dwVal &= 0x0FFFFFFF;
			dwVal *= 10;
	}
	if( str == pStartStr )
	{
		*str++ = '0';
		*str = 0;
	}// ничего не напечатали, значит 0
	*str = 0;//конец строки
	return str;
}
//=============================================================================
// Функция преобразования беззнакового целого в строку с заполнением нулями незначащих знаков и с возвратом указателя на конец строки 
// выполняется максимум 8мксек на STM32F207
// Аргументы функции:
// str - буфер для печати строки
// dwVal - Печатаемое значение
// dwMinDec - Минимальное кол-во печатаемых знаков
// функция возвращает указатель на конец строки
//=============================================================================
char * UintToStr0( char * str, unsigned int dwVal, unsigned int dwMinDec )
{
	if( !str )
		return str;
	char * pStartStr = str;
  unsigned int dwDig, dwPrint, dwDec;
	dwPrint = 0;
	//алгоритм разбиваем на 2 этапа 1..99999 и 100000..макс32бит
	if( dwVal > 99999 )
	{
		dwDec = 10;
		unsigned int dwVal1 = dwVal / 100000;//готовим старшие десятичные разряды для перобразования
		dwVal -= dwVal1 * 100000;

		//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
		dwVal1 *= 26844;
		for( unsigned int i = 0; i < 5; i++ )
		{
				dwDig = dwVal1 >> 28;
				if( dwDig || dwPrint || dwDec-- <= dwMinDec )//нули печатаем, если время пришло
				{
						*str++ = dwDig + '0';
						dwPrint = 1;
				}
				dwVal1 &= 0x0FFFFFFF;
				dwVal1 *= 10;
		}
	}

	//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
	dwDec = 5;
	// в алгоритме есть выколотая точка, учитываем её особым образом
	if( dwVal == 59075 ) 
	{
		*str++ = '5'; *str++ = '9'; *str++ = '0'; *str++ = '7'; *str++ = '5'; *str = 0; return str;
	}
	if( dwVal > 59075 )
		dwVal--;
	//основная часть алгоритма для оставшихся младших десятичных разрядов
	dwVal *= 26844;
	for( unsigned int i = 0; i < 5; i++ )
	{
			dwDig = dwVal >> 28;
			if( dwDig || dwPrint || dwDec-- <= dwMinDec )//нули печатаем, если время пришло
			{
					*str++ = dwDig + '0';
					dwPrint = 1;
			}
			dwVal &= 0x0FFFFFFF;
			dwVal *= 10;
	}
	if( str == pStartStr )
	{
		*str++ = '0';
		*str = 0;
	}// ничего не напечатали, значит 0
	*str = 0;//конец строки
	return str;
}
//=============================================================================
// Функция преобразования беззнакового целого в hex строку с возвратом указателя на конец строки 
// Аргументы функции:
// str - буфер для печати строки
// dwVal - Печатаемое значение
// функция возвращает указатель на конец строки
//=============================================================================
char * UintToHexStr( char * str, unsigned int dwVal )
{
	if( !str )
		return str;
	char * pch = &str[ 7 ];
	unsigned char by;
	// просто последовательно печатаем со старшего разряда до младшего
	while( pch >= str )
	{
		by = dwVal & 0x0F;
		dwVal >>= 4;
		if( by > 9 )
			*pch-- = ( 'A' - 10 ) + by;
		else
			*pch-- = '0' + by;
	}
	pch += 9;
	*pch = 0;//конец строки
	return pch;
}
//=============================================================================
// Функция преобразования беззнакового 2 байтного целого в hex строку с возвратом указателя на конец строки 
// Аргументы функции:
// str - буфер для печати строки
// wVal - Печатаемое значение
// функция возвращает указатель на конец строки
//=============================================================================
char * WordToHexStr( char * str, unsigned short int wVal )
{
	if( !str )
		return str;
	char * pch = &str[ 3 ];
	unsigned char by;
	// просто последовательно печатаем со старшего разряда до младшего
	while( pch >= str )
	{
		by = wVal & 0x0F;
		wVal >>= 4;
		if( by > 9 )
			*pch-- = ( 'A' - 10 ) + by;
		else
			*pch-- = '0' + by;
	}
	pch += 5;
	*pch = 0;//конец строки
	return pch;
}
//=============================================================================
// Функция преобразования беззнакового 1 байтного целого в hex строку с возвратом указателя на конец строки 
// Аргументы функции:
// str - буфер для печати строки
// byVal - Печатаемое значение
// функция возвращает указатель на конец строки
//=============================================================================
char * ByteToHexStr( char * str, unsigned char byVal )
{
	if( !str )
		return str;
	char * pch = &str[ 1 ];
	unsigned char by;
	// просто последовательно печатаем со старшего разряда до младшего
	while( pch >= str )
	{
		by = byVal & 0x0F;
		byVal >>= 4;
		if( by > 9 )
			*pch-- = ( 'A' - 10 ) + by;
		else
			*pch-- = '0' + by;
	}
	pch += 3;
	*pch = 0;//конец строки
	return pch;
}
//=============================================================================
// Функция преобразования знакового целого в строку с возвратом указателя на конец строки 
// выполняется максимум 8мксек на STM32F207
// Аргументы функции:
// str - буфер для печати строки
// iVal - Печатаемое значение
// функция возвращает указатель на конец строки
//=============================================================================
char * IntToStr( char * str, int iVal )
{
	if( !str )
		return str;
	// просто печатаем сначала знак, а затем оставшееся как беззнаковое
	if( iVal < 0 )
	{	
		*str++ = '-';
		iVal = -iVal;
	}
	str = UintToStr( str, (unsigned int)iVal );
	return str;
}
//=============================================================================
// Функция преобразования числа с плавающей точкой в строку с возвратом указателя на конец строки 
// необходимо учитывать что общее количество печатаемых знаков максимум 9, включая указанные знаки после десятичной точки
// выполняется максимум 14мксек на STM32F207
// Аргументы функции:
// str - буфер для печати строки
// f - Печатаемое значение
// dwDigCount - Кол-во печатаемых знаков после десятичной точки
// функция возвращает указатель на конец строки
//=============================================================================
char * FloatToStr( char * str, float f, unsigned int dwDigCount )
{
	if( !str )
		return str;

	char * pStartStr = str;

	// коэффициенты для каждго из возможных количеств знаков после десятичной точки
	static const long iCoefTab[ 10 ] = { 1, 10, 100, 1000, 10000, 100000, 1000000, 10000000, 100000000, 1000000000 };
	long iVal = f * iCoefTab[ dwDigCount ];// преобразуем в целое, чтоб его напечатать

	if( iVal < 0 )//печатаем знак, далее будет беззнаковое
	{	
		*str++ = '-';
		iVal = -iVal;
	}

	unsigned int dwVal = iVal;
  unsigned int dwDig, dwPrint, dwDigIndex;
	dwPrint = 0;
//алгоритм разбиваем на 2 этапа 1..99999 и 100000..макс32бит
	if( dwVal > 99999 || dwDigCount > 5 )
	{
		dwDigIndex = 10;//текущий идекс знака
		unsigned int dwVal1 = dwVal / 100000;//готовим старшие десятичные разряды для перобразования
		dwVal -= dwVal1 * 100000;

		//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
		dwVal1 *= 26844;
		for( unsigned int i = 0; i < 5; i++ )
		{
			if( dwDigIndex == dwDigCount )
				*str++ = '.';//печатаем точку, как придёт время
			if( --dwDigIndex <= dwDigCount )
				dwPrint = 1;
			dwDig = dwVal1 >> 28;
			if( dwDig || dwPrint )//нули печатаем, если только какое либо ненулевое значение уже напечатано
			{
					*str++ = dwDig + '0';
					dwPrint = 1;
			}
			dwVal1 &= 0x0FFFFFFF;
			dwVal1 *= 10;
		}
	}

	//быстрый алгоритм, основанный специальном множителе, приводящем к десятичному представлению старшего разряда в стрших 4 битах 32 битного беззнакового целого
	dwDigIndex = 5;//текущий идекс знака
	// в алгоритме есть выколотая точка, учитываем её особым образом
	if( dwVal == 59075 ) 
	{
		if( dwDigIndex-- == dwDigCount ) *str++ = '.';
		*str++ = '5';
		if( dwDigIndex-- == dwDigCount ) *str++ = '.';
		*str++ = '9';
		if( dwDigIndex-- == dwDigCount ) *str++ = '.';
		*str++ = '0';
		if( dwDigIndex-- == dwDigCount ) *str++ = '.';
		*str++ = '7';
		if( dwDigIndex-- == dwDigCount ) *str++ = '.';
		*str++ = '5';
		*str = 0;
		return str;
	}
	if( dwVal > 59075 )
		dwVal--;
	//основная часть алгоритма для оставшихся младших десятичных разрядов
  dwVal *= 26844;
	for( unsigned int i = 0; i < 5; i++ )
	{
		if( dwDigIndex == dwDigCount )
			*str++ = '.';//печатаем точку, как придёт время
		if( --dwDigIndex <= dwDigCount )
			dwPrint = 1;
		dwDig = dwVal >> 28;
		if( dwDig || dwPrint )//нули печатаем, если только какое либо ненулевое значение уже напечатано
		{
				*str++ = dwDig + '0';
				dwPrint = 1;
		}
		dwVal &= 0x0FFFFFFF;
		dwVal *= 10;
	}
	if( str == pStartStr )
	{
		*str++ = '0';
		*str = 0;
	}// ничего не напечатали, значит 0
	*str = 0;//конец строки
	
	return  str;
}
char * IPToStr( char * str, unsigned int IPAddr )
{
	int i;
	
	for( i = 0; i < 4; i++ )
	{
		str = ByteToStr( str, ( (unsigned char*)IPAddr )[ i ] );
		*str++ = '.';
	}
	*--str = 0;
	return str;
}

//=============================================================================
// Функция преобразования строки до разделителя в беззнаковое целое с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// cDel - символ разделитель
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int StrToUint( char *str, unsigned int * pResult, char cDelim )
{
	if( !str ) 
		return 0;
	while( *str == ' ' )
		str++;//отбрасываем лишние пробелы
	*pResult = 0;
	unsigned int dwCnt = 11;//максимальное количество проверяемых символов в строке
	while( --dwCnt )
	{
		char ch = *str;
		if( ch < '0' || ch > '9' )
			break;// число закончилось, выходим
		if( *pResult > 429496729 || ( *pResult == 429496729 && ch > '5' ) )
			return 0;//число за рамками беззнакового целого, выходим с ошибкой
		*pResult *= 10;
		*pResult += ch - '0';
		str++;
	}
	while( *str == ' ' )
		str++;//отбрасываем лишние пробелы
	return dwCnt < 10 /*&& ( *str == cDelim || *str == 0 )*/;// проверяем что всё число преобразовали до разделителя или конца строки, иначе ошибка
}
//=============================================================================
// Функция преобразования строки до разделителя в знаковое целое с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// cDelim - символ разделитель
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int StrToInt( char *str, int * pResult, char cDelim )
{
	if( !str )
		return 0;
	while( *str == ' ' )
		str++;//отбрасываем лишние пробелы
	int bSign = *str == '-';//проверяем наличие знака
	if( bSign || *str == '+' )
		str++;
	*pResult = 0;
	unsigned int dwCnt = 11;//максимальное количество проверяемых символов в строке
	while( --dwCnt )
	{
		char ch = *str;
		if( ch < '0' || ch > '9' )
			break;// число закончилось, выходим
		if( *pResult > 214748364 || ( *pResult == 214748364 && ch > '7' ) )
			return 0;//число за рамками беззнакового целого, выходим с ошибкой
		*pResult *= 10;
		*pResult += ch - '0';
		str++;
	}
	if( bSign )
		*pResult = -*pResult;//учитываем знак  
	while( *str == ' ' )
		str++;//отбрасываем лишние пробелы
	return dwCnt < 10 /*&& ( *str == cDelim || *str == 0 )*/;// проверяем что всё число преобразовали до разделителя или конца строки, иначе ошибка
}
//=============================================================================
// Функция преобразования строки в число с плавающей точкой с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// cDelim - символ разделитель
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int StrToFloat( char *str, float * pResult, char cDelim )
{
	if( !str )
		return 0;
	while( *str == ' ' )
		str++;//отбрасываем лишние пробелы
	char * pStart = str;
	if( *str == '+' || *str == '-' )
		str++;//проверяем знак
	// проверяем цифры до десятичной точки
	unsigned int dwCnt = 0;
	while( *str >= '0' && *str <= '9' )
	{
		str++;
		dwCnt++;
	}
	if( !dwCnt )
		return 0;
	if( *str == '.' ) str++;// проверяем десятичную точку
	while( *str >= '0' && *str <= '9' )
		str++;// проверяем цифры после десятичной точки
	while( *str == ' ' )
		str++;//отбрасываем лишние пробелы
	/*if( *str != cDelim )
		return 0;//проверяем символ-разделитель*/

	*pResult = atof( pStart );// само преобразование готовой библиотечной функцией
	return 1;
}
//=============================================================================
// Функция преобразования hex строки из 2 символов в 1 байтное беззнаковое целое с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int HexStr2ToByte( char * str, unsigned char * pResult )
{
	*pResult = 0;
	if( !str )
		return 0;
	unsigned int dwCnt = 2;//количество проверяемых символов в строке
	while( dwCnt-- ) 
	{
		char ch = *str++;
		*pResult <<= 4;
		if( ch >= '0' && ch <= '9' )
			*pResult += ch - '0';
		else if( ch >= 'A' && ch <= 'F' )
			*pResult += ch - 'A' + 10;
		else if( ch >= 'a' && ch <= 'f' )
			*pResult += ch - 'a' + 10;
		else
			return 0;
	}
	return 1;
}
//=============================================================================
// Функция преобразования hex строки из 4 символов в 2 байтное беззнаковое целое с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int HexStr4ToWord( char* str, unsigned short int * pResult )
{
	*pResult = 0;
	if( !str )
		return 0;
	unsigned int dwCnt = 4;//количество проверяемых символов в строке
	while( dwCnt-- ) 
	{
		char ch = *str++;
		*pResult <<= 4;
		if( ch >= '0' && ch <= '9' )
			*pResult += ch - '0';
		else if( ch >= 'A' && ch <= 'F' )
			*pResult += ch - 'A' + 10;
		else if( ch >= 'a' && ch <= 'f' )
			*pResult += ch - 'a' + 10;
		else
			return 0;
	}
	return 1;
}
//=============================================================================
// Функция преобразования hex строки из 8 символов в 4 байтное беззнаковое целое с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int HexStr8ToUint( char* str, unsigned int * pResult )
{
	*pResult = 0;
	if( !str )
		return 0;
	unsigned int dwCnt = 8;//количество проверяемых символов в строке
	while( dwCnt-- ) 
	{
		char ch = *str++;
		*pResult <<= 4;
		if( ch >= '0' && ch <= '9' )
			*pResult += ch - '0';
		else if( ch >= 'A' && ch <= 'F' )
			*pResult += ch - 'A' + 10;
		else if( ch >= 'a' && ch <= 'f' )
			*pResult += ch - 'a' + 10;
		else
			return 0;
	}
	return 1;
}
//=============================================================================
// Функция преобразования hex строки до разделителя в знаковое целое с проверкой валидности исходных данных
// Аргументы функции:
// str - буфер с числом для преобразования
// pResult - Указатель, куда записать результат преобразования
// cDel - символ разделитель
// функция возвращает результат проверки валидности исходных данных
//=============================================================================
int HexStrToUint( char* str, unsigned int * pResult, char cDel )
{
	*pResult = 0;
	if( !str )
		return 0;
	unsigned int dwCnt = 8;//максимальное количество проверяемых символов в строке
	while( dwCnt-- ) 
	{
		char ch = *str++;
		if( ch >= '0' && ch <= '9' )
			ch -= '0';
		else if( ch >= 'A' && ch <= 'F' )
			ch -= 'A' - 10;
		else if( ch >= 'a' && ch <= 'f' )
			ch -= 'a' - 10;
		else
			return ch == cDel;//число закончилось, выходим
		*pResult <<= 4;
		*pResult += ch;
	}
	return *str == cDel;// проверяем, что дошли до разделителя.
}
//==============================================================================

int StrToIP( char * str, unsigned int *pResult )
{
	int i;
	unsigned int ip[4];
	
	for( i = 0; i < 3; i++ )// преобразуем каждый из 4 байтов разделённых "."
	{
		if( !StrToUint( str, &ip[ i ], '.' ))// преобразование с проверкой формата )
			return 0;// проверка корректности строкового представления в звпросе и преобразование в число
		str = strchr( str, '.' ) + 1;
	}
	if( !StrToUint( str, &ip[ 3 ], '.' ))// преобразование с проверкой формата )
		return 0;// проверка корректности строкового представления в звпросе и преобразование в число
	for( i = 0; i < 4; i++ )// проверяем диапазон - байты
	{
		if( ip[ i ] > 255 )
			return 0;// проверка корректности строкового представления в звпросе и преобразование в число
	}			
	*pResult = ip[0] | (ip[1] << 8) | (ip[2] << 16) | (ip[3] << 24);
	return 1;
}
